[
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6b/WhatsApp.svg",
    "title": "WhatsApp Messenger",
    "companyName": "Meta Platforms, Inc.",
    "id": 1,
    "description": "WhatsApp Messenger is a globally acclaimed freeware, cross-platform, centralized instant messaging and voice-over-IP service owned by American company Meta Platforms. It allows users to send text, voice messages, and video messages, make voice and video calls, and share images, documents, user locations, and other content. WhatsApp's client application runs on mobile devices, and it can be accessed from desktop computers. The service requires a cellular mobile telephone number to sign up. In January 2018, WhatsApp released a standalone business app targeted at small business owners, called WhatsApp Business, to allow companies to communicate with customers who use the standard WhatsApp client.",
    "size": 32,
    "reviews": "250k",
    "ratingAvg": 4.5,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 19800 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Instagram_icon.png",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 2,
    "description": "Instagram is a photo and video sharing social networking service owned by American company Meta Platforms. The app allows users to upload media that can be edited with filters and organized by hashtags and geographical tagging. Posts can be shared publicly or with pre-approved followers. Users can browse other users' content by tag and location, view trending content, like photos, and follow other users to add their content to a personal feed. The service also includes features like Stories, Reels, and IGTV for sharing ephemeral and long-form video content. Instagram has become a powerful platform for visual storytelling and marketing, enabling individuals and businesses to connect with a vast audience through compelling imagery and videos.",
    "size": 45,
    "reviews": "300k",
    "ratingAvg": 4.7,
    "downloads": "3B+",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 300 },
      { "name": "3 star", "count": 700 },
      { "name": "4 star", "count": 6500 },
      { "name": "5 star", "count": 24000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/en/a/a9/TikTok_logo.svg",
    "title": "TikTok",
    "companyName": "ByteDance",
    "id": 3,
    "description": "TikTok is a video-sharing social networking service owned by Chinese company ByteDance. The social media platform is used to make a variety of short-form videos, from genres like dance, comedy, and education, that have a duration from 15 seconds to three minutes. TikTok is an international version of Douyin, which was originally released in the Chinese market in September 2016. TikTok was launched in 2017 for iOS and Android in most markets outside of mainland China; however, it only became available worldwide after merging with another Chinese social media service, Musical.ly, on 2 August 2018. The platform's algorithm is known for its highly personalized content recommendations, which has contributed to its rapid growth and immense popularity worldwide.",
    "size": 70,
    "reviews": "350k",
    "ratingAvg": 4.4,
    "downloads": "4B+",
    "ratings": [
      { "name": "1 star", "count": 500 },
      { "name": "2 star", "count": 800 },
      { "name": "3 star", "count": 1500 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 38000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/84/Spotify_icon.svg",
    "title": "Spotify: Music and Podcasts",
    "companyName": "Spotify Ltd.",
    "id": 4,
    "description": "Spotify is a digital music, podcast, and video service that gives you access to millions of songs and other content from creators all over the world. Basic functions such as playing music are totally free, but you can also choose to upgrade to Spotify Premium. With a Premium subscription, you can download music for offline listening, enjoy ad-free playback, and get higher audio quality. Spotify is available across a range of devices, including computers, phones, tablets, speakers, TVs, and cars, and you can easily transition from one to another with Spotify Connect. The platform's discovery features, such as Discover Weekly and Release Radar, provide personalized recommendations to help users find new music and podcasts they might love.",
    "size": 55,
    "reviews": "200k",
    "ratingAvg": 4.6,
    "downloads": "2.5B+",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 24500 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/83/Telegram_2019_Logo.svg",
    "title": "Telegram Messenger",
    "companyName": "Telegram FZ-LLC",
    "id": 5,
    "description": "Telegram is a freeware, cross-platform, cloud-based instant messaging service. The service also provides end-to-end encrypted video calling, VoIP, file sharing and several other features. It was launched for iOS on 14 August 2013 and Android in October 2013. The servers of Telegram are distributed worldwide to decrease data load with five data centers in different regions, while the operational center is based in Dubai in the United Arab Emirates. Telegram is known for its focus on security and privacy, offering features like secret chats with end-to-end encryption, self-destructing messages, and protection against screenshots. It also supports large group chats and channels for broadcasting messages to a wide audience.",
    "size": 60,
    "reviews": "180k",
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 2500 },
      { "name": "5 star", "count": 9750 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/en/8/80/Wikipedia-logo-v2.svg",
    "title": "Wikipedia",
    "companyName": "Wikimedia Foundation",
    "id": 6,
    "description": "Wikipedia is a free, multilingual open-collaborative online encyclopedia created and maintained by a community of volunteer editors using a wiki-based editing system. It is the largest and most-read reference work in history. It is consistently one of the 10 most popular websites in the world, and as of 2024, is ranked the 5th most visited website on the Internet by Semrush. Wikipedia was launched on January 15, 2001, by Jimmy Wales and Larry Sanger; Sanger coined its name as a portmanteau of 'wiki' and 'encyclopedia'. The project's open-source and community-driven model has allowed it to accumulate a vast repository of knowledge on a wide range of subjects, making it an invaluable resource for people around the globe.",
    "size": 11,
    "reviews": "120k",
    "ratingAvg": 4.7,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 11500 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/en/0/04/Facebook_f_logo_%282021%29.svg",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 7,
    "description": "Facebook is a social networking service launched as TheFacebook on February 4, 2004. It was founded by Mark Zuckerberg and his college roommates and fellow Harvard University students, in particular Eduardo Saverin, Andrew McCollum, Dustin Moskovitz and Chris Hughes. The website's membership was initially limited by the founders to Harvard students, but was expanded to other colleges in the Boston area, the Ivy League, and gradually most universities in the United States and Canada, corporations, and by September 2006, to everyone with a valid email address along with an age requirement of 13 and up. The platform allows users to create a personal profile, connect with friends and family, share updates, photos, and videos, and join groups based on common interests. Facebook has become an integral part of daily life for billions of people, shaping how we communicate and interact with one another.",
    "size": 50,
    "reviews": "220k",
    "ratingAvg": 4.3,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 200 },
      { "name": "2 star", "count": 400 },
      { "name": "3 star", "count": 1000 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 20800 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/6a/Youtube_Music_icon.svg",
    "title": "YouTube Music",
    "companyName": "Google LLC",
    "id": 8,
    "description": "YouTube Music is a music streaming service developed by YouTube, a subsidiary of Google. It provides a tailored interface for the service oriented towards music streaming, allowing users to browse through songs and music videos on YouTube based on genres, playlists, and recommendations. The service also offers a premium tier, which enables ad-free playback, audio-only background playback, and downloading songs for offline playback. These subscription benefits are also offered to subscribers of Google Play Music and YouTube Premium. YouTube Music's integration with the vast library of videos on YouTube allows it to offer a unique and extensive collection of official songs, remixes, live performances, and user-generated content.",
    "size": 60,
    "reviews": "160k",
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 180 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 14300 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/b/bd/Google_Maps_Logo_2020.svg",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 9,
    "description": "Google Maps is a web mapping platform and consumer application offered by Google. It offers satellite imagery, aerial photography, street maps, 360° interactive panoramic views of streets (Street View), real-time traffic conditions, and route planning for traveling by foot, car, bike, air (in beta) and public transportation. In 2020, Google Maps was used by over 1 billion people every month. The service provides a powerful set of features for navigation and exploration, including turn-by-turn directions, information about local businesses, and the ability to create and share custom maps. Google Maps has become an essential tool for both daily commutes and long-distance travel, helping users navigate the world with ease and confidence.",
    "size": 45,
    "reviews": "200k",
    "ratingAvg": 4.5,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 150 },
      { "name": "2 star", "count": 260 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 19200 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/7e/Gmail_icon_%282020%29.svg",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 10,
    "description": "Gmail is a free email service provided by Google. As of 2019, it had 1.5 billion active users worldwide. A user typically accesses Gmail in a web browser or the official mobile app. Google also supports the use of email clients via the POP and IMAP protocols. At its launch in 2004, Gmail provided a storage capacity of one gigabyte per user, which was significantly higher than its competitors offered at the time. Today, the service comes with 15 gigabytes of storage. Users can receive emails up to 50 megabytes in size, including attachments, while they can send emails up to 25 megabytes. In order to send larger files, users can insert files from Google Drive into the message. Gmail has a search-oriented interface and a 'conversation view' similar to an Internet forum.",
    "size": 40,
    "reviews": "180k",
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/1/12/Google_Drive_icon_%282020%29.svg",
    "title": "Google Drive",
    "companyName": "Google LLC",
    "id": 11,
    "description": "Google Drive is a file storage and synchronization service developed by Google. Launched on April 24, 2012, Google Drive allows users to store files in the cloud (on Google's servers), synchronize files across devices, and share files. In addition to a website, Google Drive offers apps with offline capabilities for Windows and macOS computers, and Android and iOS smartphones and tablets. Google Drive encompasses Google Docs, Google Sheets, and Google Slides, which are a part of the Google Docs Editors office suite that permits collaborative editing of documents, spreadsheets, presentations, drawings, forms, and more. Files created and edited through the Google Docs suite are saved in Google Drive. The service provides a secure and flexible way to manage and access your files from anywhere.",
    "size": 50,
    "reviews": "150k",
    "ratingAvg": 4.3,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 120 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 450 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 9300 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/e/e1/Google_Chrome_icon_%28February_2022%29.svg",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 12,
    "description": "Google Chrome is a cross-platform web browser developed by Google. It was first released in 2008 for Microsoft Windows, built with free software components from Apple WebKit and Mozilla Firefox. It was later ported to Linux, macOS, iOS, and Android, where it is the default browser. The browser is also the main component of ChromeOS, where it serves as the platform for web applications. Most of Chrome's source code comes from Google's free and open-source software project Chromium, but Chrome is licensed as proprietary freeware. Chrome is known for its speed, simplicity, and security, offering features like automatic updates, a vast library of extensions, and seamless integration with other Google services.",
    "size": 60,
    "reviews": "210k",
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 140 },
      { "name": "2 star", "count": 220 },
      { "name": "3 star", "count": 600 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 13500 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/f/f2/Google_Pay_Logo.svg",
    "title": "Google Pay",
    "companyName": "Google LLC",
    "id": 13,
    "description": "Google Pay (formerly Android Pay) is a digital wallet platform and online payment system developed by Google to power in-app, online, and in-person contactless purchases on mobile devices, enabling users to make payments with Android phones, tablets, or watches. As of May 8, 2018, it also includes the Google Pay Send functionality, which allows users to send and receive money. The service provides a secure and convenient way to manage your finances, offering features like loyalty cards, boarding passes, and event tickets. Google Pay uses a tokenization system to protect your payment information, ensuring that your actual card details are never shared with merchants.",
    "size": 45,
    "reviews": "130k",
    "ratingAvg": 4.2,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 150 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 7000 },
      { "name": "5 star", "count": 6500 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Google_Keep_2020_Logo.svg",
    "title": "Google Keep",
    "companyName": "Google LLC",
    "id": 14,
    "description": "Google Keep is a note-taking service included as part of the free, web-based Google Docs Editors suite offered by Google. The service also includes Google Docs, Google Sheets, Google Slides, Google Drawings, Google Forms, and Google Sites. Google Keep is available as a web application as well as a mobile app for Android and iOS. The app offers a variety of tools for taking notes, including text, lists, images, and audio. Users can set reminders, which are integrated with Google Now. Text from images can be extracted using optical character recognition, and voice recordings can be transcribed. The interface allows for a single-column view or a multi-column view. Notes can be color-coded and labeled for organization.",
    "size": 35,
    "reviews": "110k",
    "ratingAvg": 4.3,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 4000 },
      { "name": "5 star", "count": 7400 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/9b/Google_Meet_icon_%282020%29.svg",
    "title": "Google Meet",
    "companyName": "Google LLC",
    "id": 15,
    "description": "Google Meet is a video-communication service developed by Google. It is one of two apps that constitute the replacement for Google Hangouts, the other being Google Chat. Google Meet is designed for professional video conferencing, allowing users to host and join secure online meetings. The service offers features like real-time captions, screen sharing, and integration with Google Calendar. During the COVID-19 pandemic, Google made Meet's premium features available to all users, which contributed to its rapid growth in popularity. The platform is widely used for remote work, online education, and virtual social gatherings, providing a reliable and accessible way for people to connect face-to-face.",
    "size": 42,
    "reviews": "90k",
    "ratingAvg": 4.1,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 250 },
      { "name": "4 star", "count": 3000 },
      { "name": "5 star", "count": 8600 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/0/09/YouTube_full-color_icon_%282017%29.svg",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 16,
    "description": "YouTube is an American online video sharing and social media platform headquartered in San Bruno, California. It was launched on February 14, 2005, by Steve Chen, Chad Hurley, and Jawed Karim. It is currently owned by Google, and is the second most visited website, after Google Search. YouTube has more than 2.5 billion monthly users who collectively watch more than one billion hours of videos each day. As of May 2019, videos were being uploaded at a rate of more than 500 hours of content per minute. The platform has become a powerful force in popular culture, providing a space for user-generated and corporate media content to be shared and consumed by a global audience.",
    "size": 80,
    "reviews": "400k",
    "ratingAvg": 4.6,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 300 },
      { "name": "2 star", "count": 500 },
      { "name": "3 star", "count": 1200 },
      { "name": "4 star", "count": 8000 },
      { "name": "5 star", "count": 38000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/8/84/Spotify_icon.svg",
    "title": "Spotify",
    "companyName": "Spotify Ltd.",
    "id": 17,
    "description": "Spotify is a proprietary Swedish audio streaming and media services provider founded on 23 April 2006 by Daniel Ek and Martin Lorentzon. It is the world's largest music streaming service provider, with over 365 million monthly active users, including 165 million paying subscribers, as of June 2021. Spotify offers digital copyright restricted recorded music and podcasts, including more than 70 million songs, from record labels and media companies. As a freemium service, basic features are free with advertisements and limited control, while additional features, such as offline listening and commercial-free listening, are offered via paid subscriptions. The platform's sophisticated algorithms and curated playlists have made it a leader in music discovery and personalization.",
    "size": 55,
    "reviews": "220k",
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 130 },
      { "name": "2 star", "count": 210 },
      { "name": "3 star", "count": 520 },
      { "name": "4 star", "count": 4900 },
      { "name": "5 star", "count": 15600 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/d/d5/Slack_icon_2019.svg",
    "title": "Slack",
    "companyName": "Slack Technologies",
    "id": 18,
    "description": "Slack is a proprietary business communication platform developed by American software company Slack Technologies. Slack offers many IRC-style features, including persistent chat rooms (channels) organized by topic, private groups, and direct messaging. Content, including files, conversations, and people, is all searchable within Slack. Users can add emoji buttons to their messages, on which other users can then click to express their reactions to messages. Slack is designed to streamline communication and collaboration within teams, providing a centralized hub for conversations, file sharing, and integrations with other work tools. The platform has become a popular choice for businesses of all sizes, helping to improve productivity and reduce reliance on email.",
    "size": 60,
    "reviews": "140k",
    "ratingAvg": 4.2,
    "downloads": "100M+",
    "ratings": [
      { "name": "1 star", "count": 80 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 300 },
      { "name": "4 star", "count": 5000 },
      { "name": "5 star", "count": 6500 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/6/60/Adobe_Acrobat_Reader_icon_%282020%29.svg",
    "title": "Adobe Acrobat Reader",
    "companyName": "Adobe Inc.",
    "id": 19,
    "description": "Adobe Acrobat is a family of application software and web services developed by Adobe Inc. to view, create, manipulate, print and manage files in Portable Document Format (PDF). The family comprises Acrobat Reader (formerly Reader), Acrobat (formerly Exchange) and Acrobat.com. The basic Acrobat Reader, available for several desktop and mobile platforms, is freeware; it supports viewing, printing and annotating of PDF files. Commercial proprietary Acrobat, available for Microsoft Windows and macOS only, can also create, edit, convert, digitally sign, encrypt, export and publish PDF files. Acrobat.com complements the family with a variety of enterprise content management and file hosting services. The software has become the industry standard for working with PDF documents, offering a comprehensive set of tools for professionals and casual users alike.",
    "size": 75,
    "reviews": "180k",
    "ratingAvg": 4.4,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 100 },
      { "name": "2 star", "count": 200 },
      { "name": "3 star", "count": 500 },
      { "name": "4 star", "count": 6000 },
      { "name": "5 star", "count": 11100 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/7/78/Dropbox_Icon.svg",
    "title": "Dropbox",
    "companyName": "Dropbox, Inc.",
    "id": 20,
    "description": "Dropbox is a file hosting service operated by the American company Dropbox, Inc., headquartered in San Francisco, California, that offers cloud storage, file synchronization, personal cloud, and client software. Dropbox was founded in 2007 by MIT students Drew Houston and Arash Ferdowsi as a startup company, with initial funding from seed accelerator Y Combinator. Dropbox creates a special folder on the user's computer, the contents of which are then synchronized to Dropbox's servers and to other computers and devices that the user has installed Dropbox on, keeping the same files up-to-date on all devices. The service provides a simple and reliable way to store, share, and access your files from anywhere, making it a popular choice for both personal and professional use.",
    "size": 65,
    "reviews": "160k",
    "ratingAvg": 4.3,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 90 },
      { "name": "2 star", "count": 160 },
      { "name": "3 star", "count": 400 },
      { "name": "4 star", "count": 4500 },
      { "name": "5 star", "count": 9300 }
    ]
  }
]